# Составить программу возведения натурального числа в третью степень (и чтобы выводились результаты в виде суммы нескольких чисел),
# учитывая следующую закономерность:

# 1^3 = 1
# 2^3 = 3+5
# 3^3 = 7+9+11
# 4^3 = 13+15+17+19
# 5^3 = 21+23+25+27+29
N = int(input('Введите число: '))
print(N)